app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT  "cats".* FROM "cats" ORDER BY "cats"."id" ASC LIMIT $1  [["LIMIT", 1]]